---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.Mechanical
source: html/9f6ad7b4-294c-a659-5eb1-2c7a3bcc969b.htm
---
# Autodesk.Revit.DB.GroupTypeId.Mechanical Property

Mechanical.

## Syntax (C#)
```csharp
public static ForgeTypeId Mechanical { get; }
```